[NoCoverage] BlockStatement
src/mocks/handlers.js:7:66
-     http.all('https://mock-carddav-server.com/*', ({ request }) => {
-       // In a real app, we'd check for specific REPORT/PROPFIND methods and body content.
-       // For now, we just return the fixture data for any request to this mock URL.
-       
-       const xmlResponse = createMultiStatusResponse([
-         mockVCardPast,
-         mockVCardToday,
-         mockVCardFuture,
-         mockVCardOutside
-       ]);
-       return new HttpResponse(xmlResponse, {
-         headers: {
-           'Content-Type': 'application/xml; charset=utf-8',
-         },
-       });
-     }),
+     http.all('https://mock-carddav-server.com/*', ({ request }) => {}),

[NoCoverage] ArrayDeclaration
src/mocks/handlers.js:11:51
-       const xmlResponse = createMultiStatusResponse([
-         mockVCardPast,
-         mockVCardToday,
-         mockVCardFuture,
-         mockVCardOutside
-       ]);
+       const xmlResponse = createMultiStatusResponse([]);

[NoCoverage] ObjectLiteral
src/mocks/handlers.js:18:42
-       return new HttpResponse(xmlResponse, {
-         headers: {
-           'Content-Type': 'application/xml; charset=utf-8',
-         },
-       });
+       return new HttpResponse(xmlResponse, {});

[NoCoverage] ObjectLiteral
src/mocks/handlers.js:19:16
-         headers: {
-           'Content-Type': 'application/xml; charset=utf-8',
-         },
+         headers: {},

[NoCoverage] StringLiteral
src/mocks/handlers.js:20:25
-           'Content-Type': 'application/xml; charset=utf-8',
+           'Content-Type': "",

[Survived] ArrayDeclaration
src/mocks/handlers.js:5:25
-   export const handlers = [
-     // Intercept PROPFIND/REPORT requests to the CardDAV URL
-     http.all('https://mock-carddav-server.com/*', ({ request }) => {
-       // In a real app, we'd check for specific REPORT/PROPFIND methods and body content.
-       // For now, we just return the fixture data for any request to this mock URL.
-       
-       const xmlResponse = createMultiStatusResponse([
-         mockVCardPast,
-         mockVCardToday,
-         mockVCardFuture,
-         mockVCardOutside
-       ]);
-       return new HttpResponse(xmlResponse, {
-         headers: {
-           'Content-Type': 'application/xml; charset=utf-8',
-         },
-       });
-     }),
-   ];
+   export const handlers = [];
Ran all tests for this mutant.

[Survived] StringLiteral
src/mocks/handlers.js:7:12
-     http.all('https://mock-carddav-server.com/*', ({ request }) => {
+     http.all("", ({ request }) => {
Ran all tests for this mutant.

[Survived] ConditionalExpression
src/utils/dateUtils.js:19:10
-            date.getMonth() === todayDate.getMonth() &&
+            true &&
Tests ran:
    App should show MainScreen when configuration exists
    App should load and store config when configuration exists
    App should pass config to FirstTimeSetup when editing configuration
  and 2 more tests!

[Survived] ConditionalExpression
src/utils/dateUtils.js:20:10
-            date.getFullYear() === todayDate.getFullYear();
+            true;
Tests ran:
    App should show MainScreen when configuration exists
    App should load and store config when configuration exists
    App should pass config to FirstTimeSetup when editing configuration
  and 2 more tests!

[Survived] MethodExpression
src/utils/dateUtils.js:30:3
-     todayDate.setHours(0, 0, 0, 0);
+     todayDate.setMinutes(0, 0, 0, 0);
Tests ran:
    App should show MainScreen when configuration exists
    App should load and store config when configuration exists
    App should pass config to FirstTimeSetup when editing configuration
  and 5 more tests!

[Survived] EqualityOperator
src/utils/dateUtils.js:31:10
-     return date < todayDate;
+     return date <= todayDate;
Tests ran:
    App should show MainScreen when configuration exists
    App should load and store config when configuration exists
    App should pass config to FirstTimeSetup when editing configuration
  and 5 more tests!

[Survived] ConditionalExpression
src/utils/storage.js:7:18
-     if (!config || typeof config !== 'object') {
+     if (!config || false) {
Tests ran:
    validateConfig should return true for valid configuration with monday
    validateConfig should return true for valid configuration with sunday
    validateConfig should return false for non-object config
  and 9 more tests!

[Survived] ConditionalExpression
src/utils/storage.js:11:7
-     if (!config.carddavUrl || typeof config.carddavUrl !== 'string') {
+     if (false) {
Tests ran:
    validateConfig should return true for valid configuration with monday
    validateConfig should return true for valid configuration with sunday
    validateConfig should return false for empty config object
  and 8 more tests!

[Survived] LogicalOperator
src/utils/storage.js:11:7
-     if (!config.carddavUrl || typeof config.carddavUrl !== 'string') {
+     if (!config.carddavUrl && typeof config.carddavUrl !== 'string') {
Tests ran:
    validateConfig should return true for valid configuration with monday
    validateConfig should return true for valid configuration with sunday
    validateConfig should return false for empty config object
  and 8 more tests!

[Survived] ConditionalExpression
src/utils/storage.js:11:29
-     if (!config.carddavUrl || typeof config.carddavUrl !== 'string') {
+     if (!config.carddavUrl || false) {
Tests ran:
    validateConfig should return true for valid configuration with monday
    validateConfig should return true for valid configuration with sunday
    validateConfig should return false for invalid URL
  and 6 more tests!

[Survived] BlockStatement
src/utils/storage.js:11:68
-     if (!config.carddavUrl || typeof config.carddavUrl !== 'string') {
-       return false;
-     }
+     if (!config.carddavUrl || typeof config.carddavUrl !== 'string') {}
Tests ran:
    validateConfig should return false for empty config object
    validateConfig should return false for missing carddavUrl
    validateConfig should return false for carddavUrl of wrong type

[Survived] ConditionalExpression
src/utils/storage.js:21:7
-     if (!config.firstDayOfWeek || typeof config.firstDayOfWeek !== 'string') {
+     if (false) {
Tests ran:
    validateConfig should return true for valid configuration with monday
    validateConfig should return true for valid configuration with sunday
    validateConfig should return false for invalid firstDayOfWeek
  and 3 more tests!

[Survived] LogicalOperator
src/utils/storage.js:21:7
-     if (!config.firstDayOfWeek || typeof config.firstDayOfWeek !== 'string') {
+     if (!config.firstDayOfWeek && typeof config.firstDayOfWeek !== 'string') {
Tests ran:
    validateConfig should return true for valid configuration with monday
    validateConfig should return true for valid configuration with sunday
    validateConfig should return false for invalid firstDayOfWeek
  and 3 more tests!

[Survived] ConditionalExpression
src/utils/storage.js:21:33
-     if (!config.firstDayOfWeek || typeof config.firstDayOfWeek !== 'string') {
+     if (!config.firstDayOfWeek || false) {
Tests ran:
    validateConfig should return true for valid configuration with monday
    validateConfig should return true for valid configuration with sunday
    validateConfig should return false for invalid firstDayOfWeek
  and 2 more tests!

[Survived] BlockStatement
src/utils/storage.js:21:76
-     if (!config.firstDayOfWeek || typeof config.firstDayOfWeek !== 'string') {
-       return false;
-     }
+     if (!config.firstDayOfWeek || typeof config.firstDayOfWeek !== 'string') {}
Tests ran:
    validateConfig should return false for missing firstDayOfWeek
    validateConfig should return false for firstDayOfWeek of wrong type

[Survived] ConditionalExpression
src/utils/storage.js:47:7
-     if (!json) {
+     if (false) {
Tests ran:
    loadConfig should load configuration from localStorage
    loadConfig should return null when no configuration exists
    isConfigured should return true when valid configuration exists
  and 4 more tests!

[Survived] BlockStatement
src/utils/storage.js:47:14
-     if (!json) {
-       return null;
-     }
+     if (!json) {}
Tests ran:
    loadConfig should return null when no configuration exists
    isConfigured should return false when no configuration exists

[Survived] BlockStatement
src/utils/storage.js:70:16
-     if (!config) {
-       return false;
-     }
+     if (!config) {}
Tests ran:
    isConfigured should return false when no configuration exists
    error scenarios should return false for corrupted data in isConfigured

[Survived] ConditionalExpression
src/utils/storage.js:70:7
-     if (!config) {
+     if (false) {
Tests ran:
    isConfigured should return true when valid configuration exists
    isConfigured should return false when no configuration exists
    isConfigured should return false when configuration is invalid
  and 1 more test!

[Survived] ConditionalExpression
src/utils/storage.js:93:7
-     if (!json) {
+     if (false) {
Tests ran:
    loadCredentials should load credentials from sessionStorage
    loadCredentials should return null when no credentials exist
    hasCredentials should return true when credentials exist
  and 2 more tests!

[Survived] BlockStatement
src/utils/storage.js:98:11
-     } catch {
-       return null;
-     }
+     } catch {}
Tests ran:
    hasCredentials should return false when credentials are corrupted

[Survived] BlockStatement
src/utils/storage.js:93:14
-     if (!json) {
-       return null;
-     }
+     if (!json) {}
Tests ran:
    loadCredentials should return null when no credentials exist
    hasCredentials should return false when no credentials exist
